using System.Collections.Generic;
using System.Globalization;

namespace Lunar.Util
{
    /// <summary>
    /// 文本资源
    /// </summary>
    public class TextResource
    {
        /// <summary>
        /// 文本资源实例，根据当前文化信息初始化
        /// </summary>
        public static TextResource Instance =
            CultureInfo.CurrentCulture.Name == "zh-TW" ? new TextResourceBaseCht() : new TextResource();

        /// <summary>
        /// 依據語系代碼切換文字顯示，目前只新增支援 zh-TW，其餘語系一律使用簡體中文
        /// </summary>
        /// <param name="cultureName"></param>
        public static void SwitchToCulture(string cultureName)
        {
            if (cultureName == "zh-TW")
            {
                Instance = new TextResourceBaseCht();
            }
            else
            {
                Instance = new TextResource();
            }
        }

        /// <summary>
        /// 旬
        /// </summary>
        public virtual string[] XUN { get; } = { "甲子", "甲戌", "甲申", "甲午", "甲辰", "甲寅" };

        /// <summary>
        /// 旬空
        /// </summary>
        public virtual string[] XUN_KONG { get; } = { "戌亥", "申酉", "午未", "辰巳", "寅卯", "子丑" };

        /// <summary>
        /// 六曜
        /// </summary>
        public virtual string[] LIU_YAO { get; } = { "先胜", "友引", "先负", "佛灭", "大安", "赤口" };

        /// <summary>
        /// 候
        /// </summary>
        public virtual string[] HOU { get; } = { "初候", "二候", "三候" };

        /// <summary>
        /// 物候
        /// </summary>
        public virtual string[] WU_HOU { get; } = { "蚯蚓结", "麋角解", "水泉动", "雁北乡", "鹊始巢", "雉始雊", "鸡始乳", "征鸟厉疾", "水泽腹坚", "东风解冻", "蛰虫始振", "鱼陟负冰", "獭祭鱼", "候雁北", "草木萌动", "桃始华", "仓庚鸣", "鹰化为鸠", "玄鸟至", "雷乃发声", "始电", "桐始华", "田鼠化为鴽", "虹始见", "萍始生", "鸣鸠拂其羽", "戴胜降于桑", "蝼蝈鸣", "蚯蚓出", "王瓜生", "苦菜秀", "靡草死", "麦秋至", "螳螂生", "鵙始鸣", "反舌无声", "鹿角解", "蜩始鸣", "半夏生", "温风至", "蟋蟀居壁", "鹰始挚", "腐草为萤", "土润溽暑", "大雨行时", "凉风至", "白露降", "寒蝉鸣", "鹰乃祭鸟", "天地始肃", "禾乃登", "鸿雁来", "玄鸟归", "群鸟养羞", "雷始收声", "蛰虫坯户", "水始涸", "鸿雁来宾", "雀入大水为蛤", "菊有黄花", "豺乃祭兽", "草木黄落", "蛰虫咸俯", "水始冰", "地始冻", "雉入大水为蜃", "虹藏不见", "天气上升地气下降", "闭塞而成冬", "鹖鴠不鸣", "虎始交", "荔挺出" };

        /// <summary>
        /// 天干
        /// </summary>
        public virtual string[] GAN { get; } = { "", "甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸" };

        /// <summary>
        /// 喜神方位，《喜神方位歌》：甲己在艮乙庚乾，丙辛坤位喜神安。丁壬只在离宫坐，戊癸原在在巽间。
        /// </summary>
        public virtual string[] POSITION_XI { get; } = { "", "艮", "乾", "坤", "离", "巽", "艮", "乾", "坤", "离", "巽" };

        /// <summary>
        /// 阳贵方位，《阳贵神歌》：甲戊坤艮位，乙己是坤坎，庚辛居离艮，丙丁兑与乾，震巽属何日，壬癸贵神安。
        /// </summary>
        public virtual string[] POSITION_YANG_GUI { get; } = { "", "坤", "坤", "兑", "乾", "艮", "坎", "离", "艮", "震", "巽" };

        /// <summary>
        /// 阴贵方位，《阴贵神歌》：甲戊见牛羊，乙己鼠猴乡，丙丁猪鸡位，壬癸蛇兔藏，庚辛逢虎马，此是贵神方。
        /// </summary>
        public virtual string[] POSITION_YIN_GUI { get; } = { "", "艮", "坎", "乾", "兑", "坤", "坤", "艮", "离", "巽", "震" };

        /// <summary>
        /// 《福神方位歌》流派1：甲乙东南是福神，丙丁正东是堪宜，戊北己南庚辛坤，壬在乾方癸在西。
        /// </summary>
        public virtual string[] POSITION_FU { get; } = { "", "巽", "巽", "震", "震", "坎", "离", "坤", "坤", "乾", "兑" };

        /// <summary>
        ///《福神方位歌》流派2：甲己正北是福神，丙辛西北乾宫存，乙庚坤位戊癸艮，丁壬巽上好追寻。
        /// </summary>
        public virtual string[] POSITION_FU_2 { get; } = { "", "坎", "坤", "乾", "巽", "艮", "坎", "坤", "乾", "巽", "艮" };

        /// <summary>
        /// 财神方位，《财神方位歌》：甲乙东北是财神，丙丁向在西南寻，戊己正北坐方位，庚辛正东去安身，壬癸原来正南坐，便是财神方位真。
        /// </summary>
        public virtual string[] POSITION_CAI { get; } = { "", "艮", "艮", "坤", "坤", "坎", "坎", "震", "震", "离", "离" };

        /// <summary>
        /// 逐日胎神方位
        /// </summary>
        public virtual string[] POSITION_TAI_DAY { get; } =
        {
            "占门碓 外东南", "碓磨厕 外东南", "厨灶炉 外正南", "仓库门 外正南", "房床栖 外正南", "占门床 外正南", "占碓磨 外正南", "厨灶厕 外西南", "仓库炉 外西南", "房床门 外西南",
            "占门栖 外西南", "碓磨床 外西南", "厨灶碓 外西南", "仓库厕 外正西", "房床炉 外正西", "占大门 外正西", "碓磨栖 外正西", "厨灶床 外正西", "仓库碓 外西北", "房床厕 外西北",
            "占门炉 外西北", "碓磨门 外西北", "厨灶栖 外西北", "仓库床 外西北", "房床碓 外正北", "占门厕 外正北", "碓磨炉 外正北", "厨灶门 外正北", "仓库栖 外正北", "占房床 房内北",
            "占门碓 房内北", "碓磨厕 房内北", "厨灶炉 房内北", "仓库门 房内北", "床房栖 房内中", "占门床 房内中", "占碓磨 房内南", "厨灶厕 房内南", "仓库炉 房内南", "房床门 房内西",
            "占门栖 房内东", "碓磨床 房内东", "厨灶碓 房内东", "仓库厕 房内东", "房床炉 房内中", "占大门 外东北", "碓磨栖 外东北", "厨灶床 外东北", "仓库碓 外东北", "房床厕 外东北",
            "占门炉 外东北", "碓磨门 外正东", "厨灶栖 外正东", "仓库床 外正东", "房床碓 外正东", "占门厕 外正东", "碓磨炉 外东南", "厨灶门 外东南", "仓库栖 外东南", "占房床 外东南"
        };

        /// <summary>
        /// 逐月胎神方位
        /// </summary>
        public virtual string[] POSITION_TAI_MONTH { get; } = { "占房床", "占户窗", "占门堂", "占厨灶", "占房床", "占床仓", "占碓磨", "占厕户", "占门房", "占房床", "占灶炉", "占房床" };

        /// <summary>
        /// 年太岁方位
        /// </summary>
        public virtual string[] POSITION_TAI_SUI_YEAR { get; } = { "坎", "艮", "艮", "震", "巽", "巽", "离", "坤", "坤", "兑", "坎", "坎" };

        /// <summary>
        /// 天干方位
        /// </summary>
        public virtual string[] POSITION_GAN { get; } = { "震", "震", "离", "离", "中", "中", "兑", "兑", "坎", "坎" };

        /// <summary>
        /// 地支方位
        /// </summary>
        public virtual string[] POSITION_ZHI { get; } = { "坎", "中", "震", "震", "中", "离", "离", "中", "兑", "兑", "中", "坎" };

        /// <summary>
        /// 地支
        /// </summary>
        public virtual string[] ZHI { get; } = { "", "子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥" };

        /// <summary>
        /// 六十甲子
        /// </summary>
        public virtual string[] JIA_ZI { get; } = { "甲子", "乙丑", "丙寅", "丁卯", "戊辰", "己巳", "庚午", "辛未", "壬申", "癸酉", "甲戌", "乙亥", "丙子", "丁丑", "戊寅", "己卯", "庚辰", "辛巳", "壬午", "癸未", "甲申", "乙酉", "丙戌", "丁亥", "戊子", "己丑", "庚寅", "辛卯", "壬辰", "癸巳", "甲午", "乙未", "丙申", "丁酉", "戊戌", "己亥", "庚子", "辛丑", "壬寅", "癸卯", "甲辰", "乙巳", "丙午", "丁未", "戊申", "己酉", "庚戌", "辛亥", "壬子", "癸丑", "甲寅", "乙卯", "丙辰", "丁巳", "戊午", "己未", "庚申", "辛酉", "壬戌", "癸亥" };

        /// <summary>
        /// 十二值星
        /// </summary>
        public virtual string[] ZHI_XING { get; } = { "", "建", "除", "满", "平", "定", "执", "破", "危", "成", "收", "开", "闭" };

        /// <summary>
        /// 十二天神
        /// </summary>
        public virtual string[] TIAN_SHEN { get; } = { "", "青龙", "明堂", "天刑", "朱雀", "金匮", "天德", "白虎", "玉堂", "天牢", "玄武", "司命", "勾陈" };

        /// <summary>
        /// 宜忌
        /// </summary>
        public virtual string[] YI_JI { get; } = { "祭祀", "祈福", "求嗣", "开光", "塑绘", "齐醮", "斋醮", "沐浴", "酬神", "造庙", "祀灶", "焚香", "谢土", "出火", "雕刻", "嫁娶", "订婚", "纳采", "问名", "纳婿", "归宁", "安床", "合帐", "冠笄", "订盟", "进人口", "裁衣", "挽面", "开容", "修坟", "启钻", "破土", "安葬", "立碑", "成服", "除服", "开生坟", "合寿木", "入殓", "移柩", "普渡", "入宅", "安香", "安门", "修造", "起基", "动土", "上梁", "竖柱", "开井开池", "作陂放水", "拆卸", "破屋", "坏垣", "补垣", "伐木做梁", "作灶", "解除", "开柱眼", "穿屏扇架", "盖屋合脊", "开厕", "造仓", "塞穴", "平治道涂", "造桥", "作厕", "筑堤", "开池", "伐木", "开渠", "掘井", "扫舍", "放水", "造屋", "合脊", "造畜稠", "修门", "定磉", "作梁", "修饰垣墙", "架马", "开市", "挂匾", "纳财", "求财", "开仓", "买车", "置产", "雇佣", "出货财", "安机械", "造车器", "经络", "酝酿", "作染", "鼓铸", "造船", "割蜜", "栽种", "取渔", "结网", "牧养", "安碓磑", "习艺", "入学", "理发", "探病", "见贵", "乘船", "渡水", "针灸", "出行", "移徙", "分居", "剃头", "整手足甲", "纳畜", "捕捉", "畋猎", "教牛马", "会亲友", "赴任", "求医", "治病", "词讼", "起基动土", "破屋坏垣", "盖屋", "造仓库", "立券交易", "交易", "立券", "安机", "会友", "求医疗病", "诸事不宜", "馀事勿取", "行丧", "断蚁", "归岫", "无" };

        /// <summary>
        /// 神煞
        /// </summary>
        public virtual string[] SHEN_SHA { get; } = { "天恩", "鸣吠", "母仓", "不将", "四相", "鸣吠对", "五合", "三合", "除神", "月德", "月空", "月德合", "月恩", "时阴", "五富", "生气", "金匮", "相日", "阴德", "六合", "益后", "青龙", "续世", "明堂", "王日", "要安", "官日", "吉期", "福德", "六仪", "金堂", "宝光", "民日", "临日", "天马", "敬安", "普护", "驿马", "天后", "阳德", "天喜", "天医", "司命", "圣心", "玉宇", "守日", "时德", "解神", "时阳", "天仓", "天巫", "玉堂", "福生", "天德", "天德合", "天愿", "天赦", "天符", "阴神", "解除", "五虚", "五离", "重日", "复日", "血支", "天贼", "土符", "游祸", "白虎", "小耗", "致死", "河魁", "劫煞", "月煞", "月建", "往亡", "大时", "大败", "咸池", "厌对", "招摇", "九坎", "九焦", "天罡", "死神", "月害", "死气", "月破", "大耗", "天牢", "元武", "月厌", "月虚", "归忌", "小时", "天刑", "朱雀", "九空", "天吏", "地火", "四击", "大煞", "勾陈", "八专", "灾煞", "天火", "血忌", "土府", "月刑", "触水龙", "地囊", "八风", "四废", "四忌", "四穷", "五墓", "阴错", "四耗", "阳错", "孤辰", "小会", "大会", "八龙", "七鸟", "九虎", "六蛇", "天狗", "行狠", "了戾", "岁薄", "逐阵", "三丧", "三阴", "阴道冲阳", "阴位", "阴阳交破", "阴阳俱错", "阴阳击冲", "鬼哭", "单阴", "绝阴", "纯阳", "阳错阴冲", "七符", "成日", "孤阳", "绝阳", "纯阴", "大退", "四离", "阳破阴冲" };

        /// <summary>
        /// 彭祖百忌.天干
        /// </summary>
        public virtual string[] PENGZU_GAN { get; } = { "", "甲不开仓财物耗散", "乙不栽植千株不长", "丙不修灶必见灾殃", "丁不剃头头必生疮", "戊不受田田主不祥", "己不破券二比并亡", "庚不经络织机虚张", "辛不合酱主人不尝", "壬不泱水更难提防", "癸不词讼理弱敌强" };

        /// <summary>
        /// 彭祖百忌.地支
        /// </summary>
        public virtual string[] PENGZU_ZHI { get; } = { "", "子不问卜自惹祸殃", "丑不冠带主不还乡", "寅不祭祀神鬼不尝", "卯不穿井水泉不香", "辰不哭泣必主重丧", "巳不远行财物伏藏", "午不苫盖屋主更张", "未不服药毒气入肠", "申不安床鬼祟入房", "酉不会客醉坐颠狂", "戌不吃犬作怪上床", "亥不嫁娶不利新郎" };

        /// <summary>
        /// 数字
        /// </summary>
        public virtual string[] NUMBER { get; } = { "〇", "一", "二", "三", "四", "五", "六", "七", "八", "九", "十", "十一", "十二" };

        /// <summary>
        /// 月
        /// </summary>
        public virtual string[] MONTH { get; } = { "", "正", "二", "三", "四", "五", "六", "七", "八", "九", "十", "冬", "腊" };

        /// <summary>
        /// 季节
        /// </summary>
        public virtual string[] SEASON { get; } = { "", "孟春", "仲春", "季春", "孟夏", "仲夏", "季夏", "孟秋", "仲秋", "季秋", "孟冬", "仲冬", "季冬" };

        /// <summary>
        /// 生效
        /// </summary>
        public virtual string[] SHENGXIAO { get; } = { "", "鼠", "牛", "虎", "兔", "龙", "蛇", "马", "羊", "猴", "鸡", "狗", "猪" };

        /// <summary>
        /// 日
        /// </summary>
        public virtual string[] DAY { get; } = { "", "初一", "初二", "初三", "初四", "初五", "初六", "初七", "初八", "初九", "初十", "十一", "十二", "十三", "十四", "十五", "十六", "十七", "十八", "十九", "二十", "廿一", "廿二", "廿三", "廿四", "廿五", "廿六", "廿七", "廿八", "廿九", "三十" };

        /// <summary>
        /// 月相
        /// </summary>
        public virtual string[] YUE_XIANG { get; } = { "", "朔", "既朔", "蛾眉新", "蛾眉新", "蛾眉", "夕", "上弦", "上弦", "九夜", "宵", "宵", "宵", "渐盈凸", "小望", "望", "既望", "立待", "居待", "寝待", "更待", "渐亏凸", "下弦", "下弦", "有明", "有明", "蛾眉残", "蛾眉残", "残", "晓", "晦" };

        /// <summary>
        /// 地支相冲（子午相冲，丑未相冲，寅申相冲，辰戌相冲，卯酉相冲，巳亥相冲），由于地支对应十二生肖，也就对应了生肖相冲
        /// </summary>
        public virtual string[] CHONG { get; } = { "午", "未", "申", "酉", "戌", "亥", "子", "丑", "寅", "卯", "辰", "巳" };

        /// <summary>
        /// 天干相冲之无情之克（阳克阳，阴克阴）
        /// </summary>
        public virtual string[] CHONG_GAN { get; } = { "戊", "己", "庚", "辛", "壬", "癸", "甲", "乙", "丙", "丁" };

        /// <summary>
        /// 天干相冲之有情之克（阳克阴，阴克阳）
        /// </summary>
        public virtual string[] CHONG_GAN_TIE { get; } = { "己", "戊", "辛", "庚", "癸", "壬", "乙", "甲", "丁", "丙" };

        /// <summary>
        /// 天干四冲
        /// </summary>
        public virtual string[] CHONG_GAN_4 { get; } = { "庚", "辛", "壬", "癸", "", "", "甲", "乙", "丙", "丁" };

        /// <summary>
        /// 天干五合
        /// </summary>
        public virtual string[] HE_GAN_5 { get; } = { "己", "庚", "辛", "壬", "癸", "甲", "乙", "丙", "丁", "戊" };

        /// <summary>
        /// 地支六合
        /// </summary>
        public virtual string[] HE_ZHI_6 { get; } = { "丑", "子", "亥", "戌", "酉", "申", "未", "午", "巳", "辰", "卯", "寅" };

        /// <summary>
        /// 月份地支对应天神偏移下标
        /// </summary>
        public virtual Dictionary<string, int> ZHI_TIAN_SHEN_OFFSET { get; } = new Dictionary<string, int>
        {
            {"子", 4},
            {"丑", 2},
            {"寅", 0},
            {"卯", 10},
            {"辰", 8},
            {"巳", 6},
            {"午", 4},
            {"未", 2},
            {"申", 0},
            {"酉", 10},
            {"戌", 8},
            {"亥", 6}
        };

        /// <summary>
        /// 天神类型：黄道，黑道
        /// </summary>
        public virtual Dictionary<string, string> TIAN_SHEN_TYPE { get; } = new Dictionary<string, string>
        {
            {"青龙", "黄道"},
            {"明堂", "黄道"},
            {"金匮", "黄道"},
            {"天德", "黄道"},
            {"玉堂", "黄道"},
            {"司命", "黄道"},

            {"天刑", "黑道"},
            {"朱雀", "黑道"},
            {"白虎", "黑道"},
            {"天牢", "黑道"},
            {"玄武", "黑道"},
            {"勾陈", "黑道"}
        };

        /// <summary>
        /// 禄（甲禄在寅，乙禄在卯，丙戊禄在巳、丁己禄在午、庚禄在申、辛禄在酉、壬禄在亥、癸禄在子）
        /// </summary>
        public virtual Dictionary<string, string> LU { get; } = new Dictionary<string, string>
        {
            {"甲", "寅"},
            {"乙", "卯"},
            {"丙", "巳"},
            {"丁", "午"},
            {"戊", "巳"},
            {"己", "午"},
            {"庚", "申"},
            {"辛", "酉"},
            {"壬", "亥"},
            {"癸", "子"},

            {"寅", "甲"},
            {"卯", "乙"},
            {"巳", "丙,戊"},
            {"午", "丁,己"},
            {"申", "庚"},
            {"酉", "辛"},
            {"亥", "壬"},
            {"子", "癸"}
        };

        /// <summary>
        /// 天神类型吉凶
        /// </summary>
        public virtual Dictionary<string, string> TIAN_SHEN_TYPE_LUCK { get; } = new Dictionary<string, string>
        {
            {"黄道", "吉"},
            {"黑道", "凶"}
        };

        /// <summary>
        /// 节日
        /// </summary>
        public virtual Dictionary<string, string> FESTIVAL { get; } = new Dictionary<string, string>
        {
            {"1-1", "春节"},
            {"1-15", "元宵节"},
            {"2-2", "龙头节"},
            {"5-5", "端午节"},
            {"7-7", "七夕节"},
            {"8-15", "中秋节"},
            {"9-9", "重阳节"},
            {"12-8", "腊八节"}
        };

        /// <summary>
        /// 非正式节日
        /// </summary>
        public virtual Dictionary<string, List<string>> OTHER_FESTIVAL { get; } = new Dictionary<string, List<string>>
        {
            {"1-4", new List<string>(new[] {"接神日"})},
            {"1-5", new List<string>(new[] {"隔开日"})},
            {"1-7", new List<string>(new[] {"人日"})},
            {"1-8", new List<string>(new[] {"谷日", "顺星节"})},
            {"1-9", new List<string>(new[] {"天日"})},
            {"1-10", new List<string>(new[] {"地日"})},
            {"1-20", new List<string>(new[] {"天穿节"})},
            {"1-25", new List<string>(new[] {"填仓节"})},
            {"1-30", new List<string>(new[] {"正月晦"})},
            {"2-1", new List<string>(new[] {"中和节"})},
            {"2-2", new List<string>(new[] {"社日节"})},
            {"3-3", new List<string>(new[] {"上巳节"})},
            {"5-20", new List<string>(new[] {"分龙节"})},
            {"5-25", new List<string>(new[] {"会龙节"})},
            {"6-6", new List<string>(new[] {"天贶节"})},
            {"6-24", new List<string>(new[] {"观莲节"})},
            {"6-25", new List<string>(new[] {"五谷母节"})},
            {"7-15", new List<string>(new[] {"中元节"})},
            {"7-22", new List<string>(new[] {"财神节"})},
            {"7-29", new List<string>(new[] {"地藏节"})},
            {"8-1", new List<string>(new[] {"天灸日"})},
            {"10-1", new List<string>(new[] {"寒衣节"})},
            {"10-10", new List<string>(new[] {"十成节"})},
            {"10-15", new List<string>(new[] {"下元节"})},
            {"12-7", new List<string>(new[] {"驱傩日"})},
            {"12-16", new List<string>(new[] {"尾牙"})},
            {"12-24", new List<string>(new[] {"祭灶日"})}
        };

        /// <summary>
        /// 28星宿对照表，地支+星期
        /// </summary>
        public virtual Dictionary<string, string> XIU { get; } = new Dictionary<string, string>
        {
            {"申1", "毕"},
            {"申2", "翼"},
            {"申3", "箕"},
            {"申4", "奎"},
            {"申5", "鬼"},
            {"申6", "氐"},
            {"申0", "虚"},

            {"子1", "毕"},
            {"子2", "翼"},
            {"子3", "箕"},
            {"子4", "奎"},
            {"子5", "鬼"},
            {"子6", "氐"},
            {"子0", "虚"},

            {"辰1", "毕"},
            {"辰2", "翼"},
            {"辰3", "箕"},
            {"辰4", "奎"},
            {"辰5", "鬼"},
            {"辰6", "氐"},
            {"辰0", "虚"},

            {"巳1", "危"},
            {"巳2", "觜"},
            {"巳3", "轸"},
            {"巳4", "斗"},
            {"巳5", "娄"},
            {"巳6", "柳"},
            {"巳0", "房"},

            {"酉1", "危"},
            {"酉2", "觜"},
            {"酉3", "轸"},
            {"酉4", "斗"},
            {"酉5", "娄"},
            {"酉6", "柳"},
            {"酉0", "房"},

            {"丑1", "危"},
            {"丑2", "觜"},
            {"丑3", "轸"},
            {"丑4", "斗"},
            {"丑5", "娄"},
            {"丑6", "柳"},
            {"丑0", "房"},

            {"寅1", "心"},
            {"寅2", "室"},
            {"寅3", "参"},
            {"寅4", "角"},
            {"寅5", "牛"},
            {"寅6", "胃"},
            {"寅0", "星"},

            {"午1", "心"},
            {"午2", "室"},
            {"午3", "参"},
            {"午4", "角"},
            {"午5", "牛"},
            {"午6", "胃"},
            {"午0", "星"},

            {"戌1", "心"},
            {"戌2", "室"},
            {"戌3", "参"},
            {"戌4", "角"},
            {"戌5", "牛"},
            {"戌6", "胃"},
            {"戌0", "星"},

            {"亥1", "张"},
            {"亥2", "尾"},
            {"亥3", "壁"},
            {"亥4", "井"},
            {"亥5", "亢"},
            {"亥6", "女"},
            {"亥0", "昴"},

            {"卯1", "张"},
            {"卯2", "尾"},
            {"卯3", "壁"},
            {"卯4", "井"},
            {"卯5", "亢"},
            {"卯6", "女"},
            {"卯0", "昴"},

            {"未1", "张"},
            {"未2", "尾"},
            {"未3", "壁"},
            {"未4", "井"},
            {"未5", "亢"},
            {"未6", "女"},
            {"未0", "昴"}
        };

        /// <summary>
        /// 星宿对应吉凶
        /// </summary>
        public virtual Dictionary<string, string> XIU_LUCK { get; } = new Dictionary<string, string>
        {
            {"角", "吉"},
            {"亢", "凶"},
            {"氐", "凶"},
            {"房", "吉"},
            {"心", "凶"},
            {"尾", "吉"},
            {"箕", "吉"},
            {"斗", "吉"},
            {"牛", "凶"},
            {"女", "凶"},
            {"虚", "凶"},
            {"危", "凶"},
            {"室", "吉"},
            {"壁", "吉"},
            {"奎", "凶"},
            {"娄", "吉"},
            {"胃", "吉"},
            {"昴", "凶"},
            {"毕", "吉"},
            {"觜", "凶"},
            {"参", "吉"},
            {"井", "吉"},
            {"鬼", "凶"},
            {"柳", "凶"},
            {"星", "凶"},
            {"张", "吉"},
            {"翼", "凶"},
            {"轸", "吉"}
        };

        /// <summary>
        /// 星宿歌
        /// </summary>
        public virtual Dictionary<string, string> XIU_SONG { get; } = new Dictionary<string, string>
        {
            {"角", "角星造作主荣昌，外进田财及女郎，嫁娶婚姻出贵子，文人及第见君王，惟有埋葬不可用，三年之后主瘟疫，起工修筑坟基地，堂前立见主人凶。"},
            {"亢", "亢星造作长房当，十日之中主有殃，田地消磨官失职，接运定是虎狼伤，嫁娶婚姻用此日，儿孙新妇守空房，埋葬若还用此日，当时害祸主重伤。"},
            {"氐", "氐星造作主灾凶，费尽田园仓库空，埋葬不可用此日，悬绳吊颈祸重重，若是婚姻离别散，夜招浪子入房中，行船必定遭沉没，更生聋哑子孙穷。"},
            {"房", "房星造作田园进，钱财牛马遍山岗，更招外处田庄宅，荣华富贵福禄康，埋葬若然用此日，高官进职拜君王，嫁娶嫦娥至月殿，三年抱子至朝堂。"},
            {"心", "心星造作大为凶，更遭刑讼狱囚中，忤逆官非宅产退，埋葬卒暴死相从，婚姻若是用此日，子死儿亡泪满胸，三年之内连遭祸，事事教君没始终。"},
            {"尾", "尾星造作主天恩，富贵荣华福禄增，招财进宝兴家宅，和合婚姻贵子孙，埋葬若能依此日，男清女正子孙兴，开门放水招田宅，代代公侯远播名。"},
            {"箕", "箕星造作主高强，岁岁年年大吉昌，埋葬修坟大吉利，田蚕牛马遍山岗，开门放水招田宅，箧满金银谷满仓，福荫高官加禄位，六亲丰禄乐安康。"},
            {"斗", "斗星造作主招财，文武官员位鼎台，田宅家财千万进，坟堂修筑贵富来，开门放水招牛马，旺蚕男女主和谐，遇此吉宿来照护，时支福庆永无灾。"},
            {"牛", "牛星造作主灾危，九横三灾不可推，家宅不安人口退，田蚕不利主人衰，嫁娶婚姻皆自损，金银财谷渐无之，若是开门并放水，牛猪羊马亦伤悲。"},
            {"女", "女星造作损婆娘，兄弟相嫌似虎狼，埋葬生灾逢鬼怪，颠邪疾病主瘟惶，为事遭官财失散，泻利留连不可当，开门放水用此日，全家财散主离乡。"},
            {"虚", "虚星造作主灾殃，男女孤眠不一双，内乱风声无礼节，儿孙媳妇伴人床，开门放水遭灾祸，虎咬蛇伤又卒亡，三三五五连年病，家破人亡不可当。"},
            {"危", "危星不可造高楼，自遭刑吊见血光，三年孩子遭水厄，后生出外永不还，埋葬若还逢此日，周年百日取高堂，三年两载一悲伤，开门放水到官堂。"},
            {"室", "室星修造进田牛，儿孙代代近王侯，家贵荣华天上至，寿如彭祖八千秋，开门放水招财帛，和合婚姻生贵儿，埋葬若能依此日，门庭兴旺福无休。"},
            {"壁", "壁星造作主增财，丝蚕大熟福滔天，奴婢自来人口进，开门放水出英贤，埋葬招财官品进，家中诸事乐陶然，婚姻吉利主贵子，早播名誉著祖鞭。"},
            {"奎", "奎星造作得祯祥，家内荣和大吉昌，若是埋葬阴卒死，当年定主两三伤，看看军令刑伤到，重重官事主瘟惶，开门放水遭灾祸，三年两次损儿郎。"},
            {"娄", "娄星修造起门庭，财旺家和事事兴，外进钱财百日进，一家兄弟播高名，婚姻进益生贵子，玉帛金银箱满盈，放水开门皆吉利，男荣女贵寿康宁。"},
            {"胃", "胃星造作事如何，家贵荣华喜气多，埋葬贵临官禄位，夫妇齐眉永保康，婚姻遇此家富贵，三灾九祸不逢他，从此门前多吉庆，儿孙代代拜金阶。"},
            {"昴", "昴星造作进田牛，埋葬官灾不得休，重丧二日三人死，尽卖田园不记增，开门放水招灾祸，三岁孩儿白了头，婚姻不可逢此日，死别生离是可愁。"},
            {"毕", "毕星造作主光前，买得田园有余钱，埋葬此日添官职，田蚕大熟永丰年，开门放水多吉庆，合家人口得安然，婚姻若得逢此日，生得孩儿福寿全。"},
            {"觜", "觜星造作有徒刑，三年必定主伶丁，埋葬卒死多因此，取定寅年使杀人，三丧不止皆由此，一人药毒二人身，家门田地皆退败，仓库金银化作尘。"},
            {"参", "参星造作旺人家，文星照耀大光华，只因造作田财旺，埋葬招疾哭黄沙，开门放水加官职，房房子孙见田加，婚姻许遁遭刑克，男女朝开幕落花。"},
            {"井", "井星造作旺蚕田，金榜题名第一光，埋葬须防惊卒死，狂颠风疾入黄泉，开门放水招财帛，牛马猪羊旺莫言，贵人田塘来入宅，儿孙兴旺有余钱。"},
            {"鬼", "鬼星起造卒人亡，堂前不见主人郎，埋葬此日官禄至，儿孙代代近君王，开门放水须伤死，嫁娶夫妻不久长，修土筑墙伤产女，手扶双女泪汪汪。"},
            {"柳", "柳星造作主遭官，昼夜偷闭不暂安，埋葬瘟惶多疾病，田园退尽守冬寒，开门放水遭聋瞎，腰驼背曲似弓弯，更有棒刑宜谨慎，妇人随客走盘桓。"},
            {"星", "星宿日好造新房，进职加官近帝王，不可埋葬并放水，凶星临位女人亡，生离死别无心恋，要自归休别嫁郎，孔子九曲殊难度，放水开门天命伤。"},
            {"张", "张星日好造龙轩，年年并见进庄田，埋葬不久升官职，代代为官近帝前，开门放水招财帛，婚姻和合福绵绵，田蚕人满仓库满，百般顺意自安然。"},
            {"翼", "翼星不利架高堂，三年二载见瘟惶，埋葬若还逢此日，子孙必定走他乡，婚姻此日不宜利，归家定是不相当，开门放水家须破，少女恋花贪外郎。"},
            {"轸", "轸星临水造龙宫，代代为官受皇封，富贵荣华增寿禄，库满仓盈自昌隆，埋葬文昌来照助，宅舍安宁不见凶，更有为官沾帝宠，婚姻龙子入龙宫。"}
        };

        /// <summary>
        /// 兽
        /// </summary>
        public virtual Dictionary<string, string> SHOU { get; } = new Dictionary<string, string>
        {
            {"东", "青龙"},
            {"南", "朱雀"},
            {"西", "白虎"},
            {"北", "玄武"}
        };

        /// <summary>
        /// 煞
        /// </summary>
        public virtual Dictionary<string, string> SHA { get; } = new Dictionary<string, string>
        {
            {"子", "南"},
            {"丑", "东"},
            {"寅", "北"},
            {"卯", "西"},
            {"辰", "南"},
            {"巳", "东"},
            {"午", "北"},
            {"未", "西"},
            {"申", "南"},
            {"酉", "东"},
            {"戌", "北"},
            {"亥", "西"}
        };

        /// <summary>
        /// 方位描述
        /// </summary>
        public virtual Dictionary<string, string> POSITION_DESC { get; } = new Dictionary<string, string>
        {
            {"坎", "正北"},
            {"艮", "东北"},
            {"震", "正东"},
            {"巽", "东南"},
            {"离", "正南"},
            {"坤", "西南"},
            {"兑", "正西"},
            {"乾", "西北"},
            {"中", "中宫"}
        };

        /// <summary>
        /// 宫
        /// </summary>
        public virtual Dictionary<string, string> GONG { get; } = new Dictionary<string, string>
        {
            {"角", "东"},
            {"井", "南"},
            {"奎", "西"},
            {"斗", "北"},
            {"亢", "东"},
            {"鬼", "南"},
            {"娄", "西"},
            {"牛", "北"},
            {"氐", "东"},
            {"柳", "南"},
            {"胃", "西"},
            {"女", "北"},
            {"房", "东"},
            {"星", "南"},
            {"昴", "西"},
            {"虚", "北"},
            {"心", "东"},
            {"张", "南"},
            {"毕", "西"},
            {"危", "北"},
            {"尾", "东"},
            {"翼", "南"},
            {"觜", "西"},
            {"室", "北"},
            {"箕", "东"},
            {"轸", "南"},
            {"参", "西"},
            {"壁", "北"}
        };

        /// <summary>
        /// 政
        /// </summary>
        public virtual Dictionary<string, string> ZHENG { get; } = new Dictionary<string, string>
        {
            {"角", "木"},
            {"井", "木"},
            {"奎", "木"},
            {"斗", "木"},
            {"亢", "金"},
            {"鬼", "金"},
            {"娄", "金"},
            {"牛", "金"},
            {"氐", "土"},
            {"柳", "土"},
            {"胃", "土"},
            {"女", "土"},
            {"房", "日"},
            {"星", "日"},
            {"昴", "日"},
            {"虚", "日"},
            {"心", "月"},
            {"张", "月"},
            {"毕", "月"},
            {"危", "月"},
            {"尾", "火"},
            {"翼", "火"},
            {"觜", "火"},
            {"室", "火"},
            {"箕", "水"},
            {"轸", "水"},
            {"参", "水"},
            {"壁", "水"}
        };

        /// <summary>
        /// 动物
        /// </summary>
        public virtual Dictionary<string, string> ANIMAL { get; } = new Dictionary<string, string>
        {
            {"角", "蛟"},
            {"斗", "獬"},
            {"奎", "狼"},
            {"井", "犴"},
            {"亢", "龙"},
            {"牛", "牛"},
            {"娄", "狗"},
            {"鬼", "羊"},
            {"女", "蝠"},
            {"氐", "貉"},
            {"胃", "彘"},
            {"柳", "獐"},
            {"房", "兔"},
            {"虚", "鼠"},
            {"昴", "鸡"},
            {"星", "马"},
            {"心", "狐"},
            {"危", "燕"},
            {"毕", "乌"},
            {"张", "鹿"},
            {"尾", "虎"},
            {"室", "猪"},
            {"觜", "猴"},
            {"翼", "蛇"},
            {"箕", "豹"},
            {"壁", "獝"},
            {"参", "猿"},
            {"轸", "蚓"}
        };

        /// <summary>
        /// 天干五行
        /// </summary>
        public virtual Dictionary<string, string> WU_XING_GAN { get; } = new Dictionary<string, string>
        {
            {"甲", "木"},
            {"乙", "木"},
            {"丙", "火"},
            {"丁", "火"},
            {"戊", "土"},
            {"己", "土"},
            {"庚", "金"},
            {"辛", "金"},
            {"壬", "水"},
            {"癸", "水"}
        };

        /// <summary>
        /// 地支五行
        /// </summary>
        public virtual Dictionary<string, string> WU_XING_ZHI { get; } = new Dictionary<string, string>
        {
            {"寅", "木"},
            {"卯", "木"},
            {"巳", "火"},
            {"午", "火"},
            {"辰", "土"},
            {"丑", "土"},
            {"戌", "土"},
            {"未", "土"},
            {"申", "金"},
            {"酉", "金"},
            {"亥", "水"},
            {"子", "水"}
        };

        /// <summary>
        /// 纳音
        /// </summary>
        public virtual Dictionary<string, string> NAYIN { get; } = new Dictionary<string, string>
        {
            {"甲子", "海中金"},
            {"甲午", "沙中金"},
            {"丙寅", "炉中火"},
            {"丙申", "山下火"},
            {"戊辰", "大林木"},
            {"戊戌", "平地木"},
            {"庚午", "路旁土"},
            {"庚子", "壁上土"},
            {"壬申", "剑锋金"},
            {"壬寅", "金箔金"},
            {"甲戌", "山头火"},
            {"甲辰", "覆灯火"},
            {"丙子", "涧下水"},
            {"丙午", "天河水"},
            {"戊寅", "城头土"},
            {"戊申", "大驿土"},
            {"庚辰", "白蜡金"},
            {"庚戌", "钗钏金"},
            {"壬午", "杨柳木"},
            {"壬子", "桑柘木"},
            {"甲申", "泉中水"},
            {"甲寅", "大溪水"},
            {"丙戌", "屋上土"},
            {"丙辰", "沙中土"},
            {"戊子", "霹雳火"},
            {"戊午", "天上火"},
            {"庚寅", "松柏木"},
            {"庚申", "石榴木"},
            {"壬辰", "长流水"},
            {"壬戌", "大海水"},
            {"乙丑", "海中金"},
            {"乙未", "沙中金"},
            {"丁卯", "炉中火"},
            {"丁酉", "山下火"},
            {"己巳", "大林木"},
            {"己亥", "平地木"},
            {"辛未", "路旁土"},
            {"辛丑", "壁上土"},
            {"癸酉", "剑锋金"},
            {"癸卯", "金箔金"},
            {"乙亥", "山头火"},
            {"乙巳", "覆灯火"},
            {"丁丑", "涧下水"},
            {"丁未", "天河水"},
            {"己卯", "城头土"},
            {"己酉", "大驿土"},
            {"辛巳", "白蜡金"},
            {"辛亥", "钗钏金"},
            {"癸未", "杨柳木"},
            {"癸丑", "桑柘木"},
            {"乙酉", "泉中水"},
            {"乙卯", "大溪水"},
            {"丁亥", "屋上土"},
            {"丁巳", "沙中土"},
            {"己丑", "霹雳火"},
            {"己未", "天上火"},
            {"辛卯", "松柏木"},
            {"辛酉", "石榴木"},
            {"癸巳", "长流水"},
            {"癸亥", "大海水"}
        };

        /// <summary>
        /// 十神，天干+天干为键
        /// </summary>
        public virtual Dictionary<string, string> SHI_SHEN { get; } = new Dictionary<string, string>
        {
            {"甲甲", "比肩"},
            {"甲乙", "劫财"},
            {"甲丙", "食神"},
            {"甲丁", "伤官"},
            {"甲戊", "偏财"},
            {"甲己", "正财"},
            {"甲庚", "七杀"},
            {"甲辛", "正官"},
            {"甲壬", "偏印"},
            {"甲癸", "正印"},
            {"乙乙", "比肩"},
            {"乙甲", "劫财"},
            {"乙丁", "食神"},
            {"乙丙", "伤官"},
            {"乙己", "偏财"},
            {"乙戊", "正财"},
            {"乙辛", "七杀"},
            {"乙庚", "正官"},
            {"乙癸", "偏印"},
            {"乙壬", "正印"},
            {"丙丙", "比肩"},
            {"丙丁", "劫财"},
            {"丙戊", "食神"},
            {"丙己", "伤官"},
            {"丙庚", "偏财"},
            {"丙辛", "正财"},
            {"丙壬", "七杀"},
            {"丙癸", "正官"},
            {"丙甲", "偏印"},
            {"丙乙", "正印"},
            {"丁丁", "比肩"},
            {"丁丙", "劫财"},
            {"丁己", "食神"},
            {"丁戊", "伤官"},
            {"丁辛", "偏财"},
            {"丁庚", "正财"},
            {"丁癸", "七杀"},
            {"丁壬", "正官"},
            {"丁乙", "偏印"},
            {"丁甲", "正印"},
            {"戊戊", "比肩"},
            {"戊己", "劫财"},
            {"戊庚", "食神"},
            {"戊辛", "伤官"},
            {"戊壬", "偏财"},
            {"戊癸", "正财"},
            {"戊甲", "七杀"},
            {"戊乙", "正官"},
            {"戊丙", "偏印"},
            {"戊丁", "正印"},
            {"己己", "比肩"},
            {"己戊", "劫财"},
            {"己辛", "食神"},
            {"己庚", "伤官"},
            {"己癸", "偏财"},
            {"己壬", "正财"},
            {"己乙", "七杀"},
            {"己甲", "正官"},
            {"己丁", "偏印"},
            {"己丙", "正印"},
            {"庚庚", "比肩"},
            {"庚辛", "劫财"},
            {"庚壬", "食神"},
            {"庚癸", "伤官"},
            {"庚甲", "偏财"},
            {"庚乙", "正财"},
            {"庚丙", "七杀"},
            {"庚丁", "正官"},
            {"庚戊", "偏印"},
            {"庚己", "正印"},
            {"辛辛", "比肩"},
            {"辛庚", "劫财"},
            {"辛癸", "食神"},
            {"辛壬", "伤官"},
            {"辛乙", "偏财"},
            {"辛甲", "正财"},
            {"辛丁", "七杀"},
            {"辛丙", "正官"},
            {"辛己", "偏印"},
            {"辛戊", "正印"},
            {"壬壬", "比肩"},
            {"壬癸", "劫财"},
            {"壬甲", "食神"},
            {"壬乙", "伤官"},
            {"壬丙", "偏财"},
            {"壬丁", "正财"},
            {"壬戊", "七杀"},
            {"壬己", "正官"},
            {"壬庚", "偏印"},
            {"壬辛", "正印"},
            {"癸癸", "比肩"},
            {"癸壬", "劫财"},
            {"癸乙", "食神"},
            {"癸甲", "伤官"},
            {"癸丁", "偏财"},
            {"癸丙", "正财"},
            {"癸己", "七杀"},
            {"癸戊", "正官"},
            {"癸辛", "偏印"},
            {"癸庚", "正印"}
        };

        /// <summary>
        /// 地支藏干表，分别为主气、余气、杂气
        /// </summary>
        public virtual Dictionary<string, List<string>> ZHI_HIDE_GAN { get; } = new Dictionary<string, List<string>>
        {
            {"子", new List<string>(new[] { "癸" })},
            {"丑", new List<string>(new[] { "己", "癸", "辛" })},
            {"寅", new List<string>(new[] { "甲", "丙", "戊" })},
            {"卯", new List<string>(new[] { "乙" })},
            {"辰", new List<string>(new[] { "戊", "乙", "癸" })},
            {"巳", new List<string>(new[] { "丙", "庚", "戊" })},
            {"午", new List<string>(new[] { "丁", "己" })},
            {"未", new List<string>(new[] { "己", "丁", "乙" })},
            {"申", new List<string>(new[] { "庚", "壬", "戊" })},
            {"酉", new List<string>(new[] { "辛" })},
            {"戌", new List<string>(new[] { "戊", "辛", "丁" })},
            {"亥", new List<string>(new[] { "壬", "甲" })}
        };

        /// <summary>
        /// 三会日
        /// </summary>
        public virtual string[] SAN_HUI { get; } = { "1-7", "7-7", "10-15" };

        /// <summary>
        /// 三元日
        /// </summary>
        public virtual string[] SAN_YUAN { get; } = { "1-15", "7-15", "10-15" };

        /// <summary>
        /// 五腊日
        /// </summary>
        public virtual string[] WU_LA { get; } = { "1-1", "5-5", "7-7", "10-1", "12-8" };

        /// <summary>
        /// 暗戊
        /// </summary>
        public virtual string[] AN_WU { get; } = { "未", "戌", "辰", "寅", "午", "子", "酉", "申", "巳", "亥", "卯", "丑" };

        /// <summary>
        /// 八会日
        /// </summary>
        public virtual Dictionary<string, string> BA_HUI { get; } = new Dictionary<string, string>
        {
            { "丙午", "天会" },
            { "壬午", "地会" },
            { "壬子", "人会" },
            { "庚午", "日会" },
            { "庚申", "月会" },
            { "辛酉", "星辰会" },
            { "甲辰", "五行会" },
            { "甲戌", "四时会" }
        };

        /// <summary>
        /// 八节日
        /// </summary>
        public virtual Dictionary<string, string> BA_JIE { get; } = new Dictionary<string, string>
        {
            {"立春", "东北方度仙上圣天尊同梵炁始青天君下降"},
            {"春分", "东方玉宝星上天尊同青帝九炁天君下降"},
            {"立夏", "东南方好生度命天尊同梵炁始丹天君下降"},
            {"夏至", "南方玄真万福天尊同赤帝三炁天君下降"},
            {"立秋", "西南方太灵虚皇天尊同梵炁始素天君下降"},
            {"秋分", "西方太妙至极天尊同白帝七炁天君下降"},
            {"立冬", "西北方无量太华天尊同梵炁始玄天君下降"},
            {"冬至", "北方玄上玉宸天尊同黑帝五炁天君下降"}
        };

        /// <summary>
        /// 道历节日数据
        /// </summary>
        public virtual Dictionary<string, string[]> TAO_FESTIVAL_DATA { get; } = new Dictionary<string, string[]>
        {
            ["1-1"] = new[] { "天腊之辰", "天腊，此日五帝会于东方九炁青天" },
            ["1-3"] = new[] { "郝真人圣诞", "孙真人圣诞" },
            ["1-5"] = new[] { "孙祖清静元君诞" },
            ["1-7"] = new[] { "举迁赏会", "此日上元赐福，天官同地水二官考校罪福" },
            ["1-9"] = new[] { "玉皇上帝圣诞" },
            ["1-13"] = new[] { "关圣帝君飞升" },
            ["1-15"] = new[] { "上元天官圣诞", "老祖天师圣诞" },
            ["1-19"] = new[] { "长春邱真人(邱处机)圣诞" },
            ["1-28"] = new[] { "许真君(许逊天师)圣诞" },
            ["2-1"] = new[] { "勾陈天皇大帝圣诞", "长春刘真人(刘渊然)圣诞" },
            ["2-2"] = new[] { "土地正神诞", "姜太公圣诞" },
            ["2-3"] = new[] { "文昌梓潼帝君圣诞" },
            ["2-6"] = new[] { "东华帝君圣诞" },
            ["2-13"] = new[] { "度人无量葛真君圣诞" },
            ["2-15"] = new[] { "太清道德天尊(太上老君)圣诞" },
            ["2-19"] = new[] { "慈航真人圣诞" },
            ["3-1"] = new[] { "谭祖(谭处端)长真真人圣诞" },
            ["3-3"] = new[] { "玄天上帝圣诞" },
            ["3-6"] = new[] { "眼光娘娘圣诞" },
            ["3-15"] = new[] { "天师张大真人圣诞", "财神赵公元帅圣诞" },
            ["3-16"] = new[] { "三茅真君得道之辰", "中岳大帝圣诞" },
            ["3-18"] = new[] { "王祖(王处一)玉阳真人圣诞", "后土娘娘圣诞" },
            ["3-19"] = new[] { "太阳星君圣诞" },
            ["3-20"] = new[] { "子孙娘娘圣诞" },
            ["3-23"] = new[] { "天后妈祖圣诞" },
            ["3-26"] = new[] { "鬼谷先师诞" },
            ["3-28"] = new[] { "东岳大帝圣诞" },
            ["4-1"] = new[] { "长生谭真君成道之辰" },
            ["4-10"] = new[] { "何仙姑圣诞" },
            ["4-14"] = new[] { "吕祖纯阳祖师圣诞" },
            ["4-15"] = new[] { "钟离祖师圣诞" },
            ["4-18"] = new[] { "北极紫微大帝圣诞", "泰山圣母碧霞元君诞", "华佗神医先师诞" },
            ["4-20"] = new[] { "眼光圣母娘娘诞" },
            ["4-28"] = new[] { "神农先帝诞" },
            ["5-1"] = new[] { "南极长生大帝圣诞" },
            ["5-5"] = new[] { "地腊之辰", "地腊，此日五帝会于南方三炁丹天", "南方雷祖圣诞", "地祗温元帅圣诞", "雷霆邓天君圣诞" },
            ["5-11"] = new[] { "城隍爷圣诞" },
            ["5-13"] = new[] { "关圣帝君降神", "关平太子圣诞" },
            ["5-18"] = new[] { "张天师圣诞" },
            ["5-20"] = new[] { "马祖丹阳真人圣诞" },
            ["5-29"] = new[] { "紫青白祖师圣诞" },
            ["6-1"] = new[] { "南斗星君下降" },
            ["6-2"] = new[] { "南斗星君下降" },
            ["6-3"] = new[] { "南斗星君下降" },
            ["6-4"] = new[] { "南斗星君下降" },
            ["6-5"] = new[] { "南斗星君下降" },
            ["6-6"] = new[] { "南斗星君下降" },
            ["6-10"] = new[] { "刘海蟾祖师圣诞" },
            ["6-15"] = new[] { "灵官王天君圣诞" },
            ["6-19"] = new[] { "慈航(观音)成道日" },
            ["6-23"] = new[] { "火神圣诞" },
            ["6-24"] = new[] { "南极大帝中方雷祖圣诞", "关圣帝君圣诞" },
            ["6-26"] = new[] { "二郎真君圣诞" },
            ["7-7"] = new[] { "道德腊之辰", "道德腊，此日五帝会于西方七炁素天", "庆生中会", "此日中元赦罪，地官同天水二官考校罪福" },
            ["7-12"] = new[] { "西方雷祖圣诞" },
            ["7-15"] = new[] { "中元地官大帝圣诞" },
            ["7-18"] = new[] { "王母娘娘圣诞" },
            ["7-20"] = new[] { "刘祖(刘处玄)长生真人圣诞" },
            ["7-22"] = new[] { "财帛星君文财神增福相公李诡祖圣诞" },
            ["7-26"] = new[] { "张三丰祖师圣诞" },
            ["8-1"] = new[] { "许真君飞升日" },
            ["8-3"] = new[] { "九天司命灶君诞" },
            ["8-5"] = new[] { "北方雷祖圣诞" },
            ["8-10"] = new[] { "北岳大帝诞辰" },
            ["8-15"] = new[] { "太阴星君诞" },
            ["9-1"] = new[] { "北斗九皇降世之辰" },
            ["9-2"] = new[] { "北斗九皇降世之辰" },
            ["9-3"] = new[] { "北斗九皇降世之辰" },
            ["9-4"] = new[] { "北斗九皇降世之辰" },
            ["9-5"] = new[] { "北斗九皇降世之辰" },
            ["9-6"] = new[] { "北斗九皇降世之辰" },
            ["9-7"] = new[] { "北斗九皇降世之辰" },
            ["9-8"] = new[] { "北斗九皇降世之辰" },
            ["9-9"] = new[] { "北斗九皇降世之辰", "斗姥元君圣诞", "重阳帝君圣诞", "玄天上帝飞升", "酆都大帝圣诞" },
            ["9-22"] = new[] { "增福财神诞" },
            ["9-23"] = new[] { "萨翁真君圣诞" },
            ["9-28"] = new[] { "五显灵官马元帅圣诞" },
            ["10-1"] = new[] { "民岁腊之辰", "民岁腊，此日五帝会于北方五炁黑天", "东皇大帝圣诞" },
            ["10-3"] = new[] { "三茅应化真君圣诞" },
            ["10-6"] = new[] { "天曹诸司五岳五帝圣诞" },
            ["10-15"] = new[] { "下元水官大帝圣诞", "建生大会", "此日下元解厄，水官同天地二官考校罪福" },
            ["10-18"] = new[] { "地母娘娘圣诞" },
            ["10-19"] = new[] { "长春邱真君飞升" },
            ["10-20"] = new[] { "虚靖天师(即三十代天师弘悟张真人)诞" },
            ["11-6"] = new[] { "西岳大帝圣诞" },
            ["11-9"] = new[] { "湘子韩祖圣诞" },
            ["11-11"] = new[] { "太乙救苦天尊圣诞" },
            ["11-26"] = new[] { "北方五道圣诞" },
            ["12-8"] = new[] { "王侯腊之辰", "王侯腊，此日五帝会于上方玄都玉京" },
            ["12-16"] = new[] { "南岳大帝圣诞", "福德正神诞" },
            ["12-20"] = new[] { "鲁班先师圣诞" },
            ["12-21"] = new[] { "天猷上帝圣诞" },
            ["12-22"] = new[] { "重阳祖师圣诞" },
            ["12-23"] = new[] { "祭灶王", "最适宜谢旧年太岁，开启拜新年太岁" },
            ["12-25"] = new[] { "玉帝巡天", "天神下降" },
            ["12-29"] = new[] { "清静孙真君(孙不二)成道" }
        };

        /// <summary>
        /// 星座
        /// </summary>
        public virtual string[] XING_ZUO { get; } = { "白羊", "金牛", "双子", "巨蟹", "狮子", "处女", "天秤", "天蝎", "射手", "摩羯", "水瓶", "双鱼" };

        /// <summary>
        /// 阳历节日
        /// </summary>
        public virtual Dictionary<string, string> SOLAR_FESTIVAL { get; } = new Dictionary<string, string>
        {
            { "1-1", "元旦节" },
            { "2-14", "情人节" },
            { "3-8", "妇女节" },
            { "3-12", "植树节" },
            { "3-15", "消费者权益日" },
            { "4-1", "愚人节" },
            { "5-1", "劳动节" },
            { "5-4", "青年节" },
            { "6-1", "儿童节" },
            { "7-1", "建党节" },
            { "8-1", "建军节" },
            { "9-10", "教师节" },
            { "10-1", "国庆节" },
            { "10-31", "万圣节前夹" },
            { "11-1", "万圣节" },
            { "12-24", "平安夜" },
            { "12-25", "圣诞节" }
        };

        /// <summary>
        /// 阳历按星期的节日
        /// </summary>
        public virtual Dictionary<string, string> SOLAR_WEEK_FESTIVAL { get; } = new Dictionary<string, string>
        {
            { "3-0-1", "全国中小学生安全教育日" },
            { "5-2-0", "母亲节" },
            { "5-3-0", "全国助残日" },
            { "6-3-0", "父亲节" },
            { "9-3-6", "全民国防教育日" },
            { "10-1-1", "世界住房日" },
            { "11-4-4", "感恩节" }
        };

        /// <summary>
        /// 阳历非正式节日
        /// </summary>
        public virtual Dictionary<string, List<string>> SOLAR_OTHER_FESTIVAL { get; } = new Dictionary<string, List<string>>
        {
            {"1-8", new List<string>(new[] {"周恩来逃世纪念日"})},
            {"1-10", new List<string>(new[] {"中国人民警察节"})},
            {"1-14", new List<string>(new[] {"日记情人节"})},
            {"1-21", new List<string>(new[] {"列宁逃世纪念日"})},
            {"1-26", new List<string>(new[] {"国际海关日"})},
            {"1-27", new List<string>(new[] {"国际大屠杀纪念日"})},
            {"2-2", new List<string>(new[] {"世界湿地日"})},
            {"2-4", new List<string>(new[] {"世界抗癌日"})},
            {"2-7", new List<string>(new[] {"京汉铁路罢工纪念日"})},
            {"2-10", new List<string>(new[] {"国际气象节"})},
            {"2-19", new List<string>(new[] {"邓小平逃世纪念日"})},
            {"2-20", new List<string>(new[] {"世界社会公正日"})},
            {"2-21", new List<string>(new[] {"国际母语日"})},
            {"2-24", new List<string>(new[] {"第三世界青年日"})},
            {"3-1", new List<string>(new[] {"国际海豹日"})},
            {"3-3", new List<string>(new[] {"世界野生动植物日", "全国爱耳日"})},
            {"3-5", new List<string>(new[] {"周恩来诞辰纪念日", "中国青年志愿者服务日"})},
            {"3-6", new List<string>(new[] {"世界青光眼日"})},
            {"3-7", new List<string>(new[] {"女生节"})},
            {"3-12", new List<string>(new[] {"孙中山逃世纪念日"})},
            {"3-14", new List<string>(new[] {"马克思逃世纪念日", "白色情人节"})},
            {"3-17", new List<string>(new[] {"国际航海日"})},
            {"3-18", new List<string>(new[] {"全国科技人才活动日", "全国爱肝日"})},
            {"3-20", new List<string>(new[] {"国际幸福日"})},
            {"3-21", new List<string>(new[] {"世界森林日", "世界睡眠日", "国际消除种族歧视日"})},
            {"3-22", new List<string>(new[] {"世界水日"})},
            {"3-23", new List<string>(new[] {"世界气象日"})},
            {"3-24", new List<string>(new[] {"世界防治结核病日"})},
            {"3-29", new List<string>(new[] {"中国黄花岗七十二烈士殉难纪念日"})},
            {"4-2", new List<string>(new[] {"国际儿童图书日", "世界自闭症日"})},
            {"4-4", new List<string>(new[] {"国际地雷行动日"})},
            {"4-7", new List<string>(new[] {"世界卫生日"})},
            {"4-8", new List<string>(new[] {"国际珍稀动物保护日"})},
            {"4-12", new List<string>(new[] {"世界航天日"})},
            {"4-14", new List<string>(new[] {"黑色情人节"})},
            {"4-15", new List<string>(new[] {"全民国家安全教育日"})},
            {"4-22", new List<string>(new[] {"世界地球日", "列宁诞辰纪念日"})},
            {"4-23", new List<string>(new[] {"世界读书日"})},
            {"4-24", new List<string>(new[] {"中国航天日"})},
            {"4-25", new List<string>(new[] {"儿童预防接种宣传日"})},
            {"4-26", new List<string>(new[] {"世界知识产权日", "全国痟疾日"})},
            {"4-28", new List<string>(new[] {"世界安全生产与健康日"})},
            {"4-30", new List<string>(new[] {"全国交通安全反思日"})},
            {"5-2", new List<string>(new[] {"世界金枪鱼日"})},
            {"5-3", new List<string>(new[] {"世界新闻自由日"})},
            {"5-5", new List<string>(new[] {"马克思诞辰纪念日"})},
            {"5-8", new List<string>(new[] {"世界红十字日"})},
            {"5-11", new List<string>(new[] {"世界肋胖日"})},
            {"5-12", new List<string>(new[] {"全国防灾减灾日", "护士节"})},
            {"5-14", new List<string>(new[] {"玫瑰情人节"})},
            {"5-15", new List<string>(new[] {"国际家庭日"})},
            {"5-19", new List<string>(new[] {"中国旅游日"})},
            {"5-20", new List<string>(new[] {"网络情人节"})},
            {"5-22", new List<string>(new[] {"国际生物多样性日"})},
            {"5-25", new List<string>(new[] {"525心理健康节"})},
            {"5-27", new List<string>(new[] {"上海解放日"})},
            {"5-29", new List<string>(new[] {"国际维和人员日"})},
            {"5-30", new List<string>(new[] {"中国五卅运动纪念日"})},
            {"5-31", new List<string>(new[] {"世界无烟日"})},
            {"6-3", new List<string>(new[] {"世界自行车日"})},
            {"6-5", new List<string>(new[] {"世界环境日"})},
            {"6-6", new List<string>(new[] {"全国爱眼日"})},
            {"6-8", new List<string>(new[] {"世界海洋日"})},
            {"6-11", new List<string>(new[] {"中国人口日"})},
            {"6-14", new List<string>(new[] {"世界献血日", "亲亲情人节"})},
            {"6-17", new List<string>(new[] {"世界防治荒漠化与干旱日"})},
            {"6-20", new List<string>(new[] {"世界难民日"})},
            {"6-21", new List<string>(new[] {"国际瑜伽日"})},
            {"6-25", new List<string>(new[] {"全国土地日"})},
            {"6-26", new List<string>(new[] {"国际禁毒日", "联合国宪章日"})},
            {"7-1", new List<string>(new[] {"香港回归纪念日"})},
            {"7-6", new List<string>(new[] {"国际接吐日", "朱德逃世纪念日"})},
            {"7-7", new List<string>(new[] {"七七事变纪念日"})},
            {"7-11", new List<string>(new[] {"世界人口日", "中国航海日"})},
            {"7-14", new List<string>(new[] {"銀色情人节"})},
            {"7-18", new List<string>(new[] {"曼德拉国际日"})},
            {"7-30", new List<string>(new[] {"国际友谊日"})},
            {"8-3", new List<string>(new[] {"男人节"})},
            {"8-5", new List<string>(new[] {"恩格斯逃世纪念日"})},
            {"8-6", new List<string>(new[] {"国际电影节"})},
            {"8-8", new List<string>(new[] {"全民健身日"})},
            {"8-9", new List<string>(new[] {"国际土著人日"})},
            {"8-12", new List<string>(new[] {"国际青年节"})},
            {"8-14", new List<string>(new[] {"绿色情人节"})},
            {"8-19", new List<string>(new[] {"世界人道主义日", "中国医师节"})},
            {"8-22", new List<string>(new[] {"邓小平诞辰纪念日"})},
            {"8-29", new List<string>(new[] {"全国测绘法宣传日"})},
            {"9-3", new List<string>(new[] {"中国抗日战争胜利纪念日"})},
            {"9-5", new List<string>(new[] {"中华慈善日"})},
            {"9-8", new List<string>(new[] {"世界扫盲日"})},
            {"9-9", new List<string>(new[] {"毛泽东逃世纪念日", "全国拒绝酒驾日"})},
            {"9-14", new List<string>(new[] {"世界清洁地球日", "相片情人节"})},
            {"9-15", new List<string>(new[] {"国际民主日"})},
            {"9-16", new List<string>(new[] {"国际臭氧层保护日"})},
            {"9-17", new List<string>(new[] {"世界骑行日"})},
            {"9-18", new List<string>(new[] {"九一八事变纪念日"})},
            {"9-20", new List<string>(new[] {"全国爱牙日"})},
            {"9-21", new List<string>(new[] {"国际和平日"})},
            {"9-27", new List<string>(new[] {"世界旅游日"})},
            {"9-30", new List<string>(new[] {"中国烈士纪念日"})},
            {"10-1", new List<string>(new[] {"国际老年人日"})},
            {"10-2", new List<string>(new[] {"国际非暴力日"})},
            {"10-4", new List<string>(new[] {"世界动物日"})},
            {"10-11", new List<string>(new[] {"国际女童日"})},
            {"10-10", new List<string>(new[] {"辛亥革命纪念日"})},
            {"10-13", new List<string>(new[] {"国际减轻自然灾害日", "中国少年先锋队诞辰日"})},
            {"10-14", new List<string>(new[] {"葡萄酒情人节"})},
            {"10-16", new List<string>(new[] {"世界粮食日"})},
            {"10-17", new List<string>(new[] {"全国扶贫日"})},
            {"10-20", new List<string>(new[] {"世界统计日"})},
            {"10-24", new List<string>(new[] {"世界发展信息日", "程序员节"})},
            {"10-25", new List<string>(new[] {"抗美援朝纪念日"})},
            {"11-5", new List<string>(new[] {"世界海啊日"})},
            {"11-8", new List<string>(new[] {"记者节"})},
            {"11-9", new List<string>(new[] {"全国消防日"})},
            {"11-11", new List<string>(new[] {"光棍节"})},
            {"11-12", new List<string>(new[] {"孙中山诞辰纪念日"})},
            {"11-14", new List<string>(new[] {"电影情人节"})},
            {"11-16", new List<string>(new[] {"国际宽容日"})},
            {"11-17", new List<string>(new[] {"国际大学生节"})},
            {"11-19", new List<string>(new[] {"世界厕所日"})},
            {"11-28", new List<string>(new[] {"恩格斯诞辰纪念日"})},
            {"11-29", new List<string>(new[] {"国际声援巴勒斯坦人民日"})},
            {"12-1", new List<string>(new[] {"世界艾滋病日"})},
            {"12-2", new List<string>(new[] {"全国交通安全日"})},
            {"12-3", new List<string>(new[] {"世界残疾人日"})},
            {"12-4", new List<string>(new[] {"全国法制宣传日"})},
            {"12-5", new List<string>(new[] {"世界弱能人士日", "国际志愿人员日"})},
            {"12-7", new List<string>(new[] {"国际民航日"})},
            {"12-9", new List<string>(new[] {"世界足球日", "国际反腐败日"})},
            {"12-10", new List<string>(new[] {"世界人权日"})},
            {"12-11", new List<string>(new[] {"国际山岳日"})},
            {"12-12", new List<string>(new[] {"西安事变纪念日"})},
            {"12-13", new List<string>(new[] {"国家公祭日"})},
            {"12-14", new List<string>(new[] {"拥抱情人节"})},
            {"12-18", new List<string>(new[] {"国际移徙者日"})},
            {"12-26", new List<string>(new[] {"毛泽东诞辰纪念日"})}
        };

        private const string DJ = "犯者夺纪";
        private const string JS = "犯者减寿";
        private const string SS = "犯者损寿";
        private const string XL = "犯者削禄夺纪";
        private const string JW = "犯者三年内夫妇俱亡";

        private static FotoFestival Y = new FotoFestival("杨公忌");
        private static FotoFestival T = new FotoFestival("四天王巡行", "", true);
        private static FotoFestival D = new FotoFestival("斗降", DJ, true);
        private static FotoFestival S = new FotoFestival("月朔", DJ, true);
        private static FotoFestival W = new FotoFestival("月望", DJ, true);
        private static FotoFestival H = new FotoFestival("月晦", JS, true);
        private static FotoFestival L = new FotoFestival("雷斋日", JS, true);
        private static FotoFestival J = new FotoFestival("九毒日", "犯者夭亡，奇祸不测");
        private static FotoFestival R = new FotoFestival("人神在阴", "犯者得病", true, "宜先一日即戒");
        private static FotoFestival M = new FotoFestival("司命奏事", JS, true, "如月小，即戒廿九");
        private static FotoFestival HH = new FotoFestival("月晦", JS, true, "如月小，即戒廿九");

        /// <summary>
        /// 因果犯忌
        /// </summary>
        public virtual Dictionary<string, List<FotoFestival>> FOTO_FESTIVAL { get; } = new Dictionary<string, List<FotoFestival>>
        {
            {"1-1", new List<FotoFestival>(new[] { new FotoFestival("天腊，玉帝校世人神气禄命", XL), S })},
            {"1-3", new List<FotoFestival>(new[] { new FotoFestival("万神都会", DJ), D })},
            {"1-5", new List<FotoFestival>(new[] { new FotoFestival("五虚忌") })},
            {"1-6", new List<FotoFestival>(new[] { new FotoFestival("六耗忌"), L })},
            {"1-7", new List<FotoFestival>(new[] { new FotoFestival("上会日", SS) })},
            {"1-8", new List<FotoFestival>(new[] { new FotoFestival("五殿阎罗天子诞", DJ), T })},
            {"1-9", new List<FotoFestival>(new[] { new FotoFestival("玉皇上帝诞", DJ) })},
            {"1-13", new List<FotoFestival>(new[] { Y })},
            {"1-14", new List<FotoFestival>(new[] { new FotoFestival("三元降", JS), T })},
            {"1-15", new List<FotoFestival>(new[] { new FotoFestival("三元降", JS), new FotoFestival("上元神会", DJ), W, T })},
            {"1-16", new List<FotoFestival>(new[] { new FotoFestival("三元降", JS) })},
            {"1-19", new List<FotoFestival>(new[] { new FotoFestival("长春真人诞") })},
            {"1-23", new List<FotoFestival>(new[] { new FotoFestival("三尸神奏事"), T })},
            {"1-25", new List<FotoFestival>(new[] { H, new FotoFestival("天地仓开日", "犯者损寿，子带疾") })},
            {"1-27", new List<FotoFestival>(new[] { D })},
            {"1-28", new List<FotoFestival>(new[] { R })},
            {"1-29", new List<FotoFestival>(new[] { T })},
            {"1-30", new List<FotoFestival>(new[] { HH, M, T })},
            {"2-1", new List<FotoFestival>(new[] { new FotoFestival("一殿秦广王诞", DJ), S })},
            {"2-2", new List<FotoFestival>(new[] { new FotoFestival("万神都会", DJ), new FotoFestival("福德土地正神诞", "犯者得祸") })},
            {"2-3", new List<FotoFestival>(new[] { new FotoFestival("文昌帝君诞", XL), D })},
            {"2-6", new List<FotoFestival>(new[] { new FotoFestival("东华帝君诞"), L })},
            {"2-8", new List<FotoFestival>(new[] { new FotoFestival("释迦牟尼佛出家", DJ), new FotoFestival("三殿宋帝王诞", DJ), new FotoFestival("张大帝诞", DJ), T })},
            {"2-11", new List<FotoFestival>(new[] { Y })},
            {"2-14", new List<FotoFestival>(new[] { T })},
            {"2-15", new List<FotoFestival>(new[] { new FotoFestival("释迦牟尼佛涅槃", XL), new FotoFestival("太上老君诞", XL), new FotoFestival("月望", XL, true), T })},
            {"2-17", new List<FotoFestival>(new[] { new FotoFestival("东方杜将军诞") })},
            {"2-18", new List<FotoFestival>(new[] { new FotoFestival("四殿五官王诞", XL), new FotoFestival("至圣先师孔子讳辰", XL) })},
            {"2-19", new List<FotoFestival>(new[] { new FotoFestival("观音大士诞", DJ) })},
            {"2-21", new List<FotoFestival>(new[] { new FotoFestival("普贤菩萨诞") })},
            {"2-23", new List<FotoFestival>(new[] { T })},
            {"2-25", new List<FotoFestival>(new[] { H })},
            {"2-27", new List<FotoFestival>(new[] { D })},
            {"2-28", new List<FotoFestival>(new[] { R })},
            {"2-29", new List<FotoFestival>(new[] { T })},
            {"2-30", new List<FotoFestival>(new[] { HH, M, T })},
            {"3-1", new List<FotoFestival>(new[] { new FotoFestival("二殿楚江王诞", DJ), S })},
            {"3-3", new List<FotoFestival>(new[] { new FotoFestival("玄天上帝诞", DJ), D })},
            {"3-6", new List<FotoFestival>(new[] { L })},
            {"3-8", new List<FotoFestival>(new[] { new FotoFestival("六殿卞城王诞", DJ), T })},
            {"3-9", new List<FotoFestival>(new[] { new FotoFestival("牛鬼神出", "犯者产恶胎"), Y })},
            {"3-12", new List<FotoFestival>(new[] { new FotoFestival("中央五道诞") })},
            {"3-14", new List<FotoFestival>(new[] { T })},
            {"3-15", new List<FotoFestival>(new[] { new FotoFestival("昊天上帝诞", DJ), new FotoFestival("玄坛诞", DJ), W, T })},
            {"3-16", new List<FotoFestival>(new[] { new FotoFestival("准提菩萨诞", DJ) })},
            {"3-19", new List<FotoFestival>(new[] { new FotoFestival("中岳大帝诞"), new FotoFestival("后土娘娘诞"), new FotoFestival("三茅降") })},
            {"3-20", new List<FotoFestival>(new[] { new FotoFestival("天地仓开日", SS), new FotoFestival("子孙娘娘诞") })},
            {"3-23", new List<FotoFestival>(new[] { T })},
            {"3-25", new List<FotoFestival>(new[] { H })},
            {"3-27", new List<FotoFestival>(new[] { new FotoFestival("七殿泰山王诞"), D })},
            {"3-28", new List<FotoFestival>(new[] { R, new FotoFestival("苍颉至圣先师诞", XL), new FotoFestival("东岳大帝诞") })},
            {"3-29", new List<FotoFestival>(new[] { T })},
            {"3-30", new List<FotoFestival>(new[] { HH, M, T })},
            {"4-1", new List<FotoFestival>(new[] { new FotoFestival("八殿都市王诞", DJ), S })},
            {"4-3", new List<FotoFestival>(new[] { D })},
            {"4-4", new List<FotoFestival>(new[] { new FotoFestival("万神善会", "犯者失瘼夭胎"), new FotoFestival("文殊菩萨诞") })},
            {"4-6", new List<FotoFestival>(new[] { L })},
            {"4-7", new List<FotoFestival>(new[] { new FotoFestival("南斗、北斗、西斗同降", JS), Y })},
            {"4-8", new List<FotoFestival>(new[] { new FotoFestival("释迦牟尼佛诞", DJ), new FotoFestival("万神善会", "犯者失瘼夭胎"), new FotoFestival("善恶童子降", "犯者血死"), new FotoFestival("九殿平等王诞"), T })},
            {"4-14", new List<FotoFestival>(new[] { new FotoFestival("纯阳祖师诞", JS), T })},
            {"4-15", new List<FotoFestival>(new[] { W, new FotoFestival("钟离祖师诞"), T })},
            {"4-16", new List<FotoFestival>(new[] { new FotoFestival("天地仓开日", SS) })},
            {"4-17", new List<FotoFestival>(new[] { new FotoFestival("十殿转轮王诞", DJ) })},
            {"4-18", new List<FotoFestival>(new[] { new FotoFestival("天地仓开日", SS), new FotoFestival("紫徽大帝诞", SS) })},
            {"4-20", new List<FotoFestival>(new[] { new FotoFestival("眼光圣母诞") })},
            {"4-23", new List<FotoFestival>(new[] { T })},
            {"4-25", new List<FotoFestival>(new[] { H })},
            {"4-27", new List<FotoFestival>(new[] { D })},
            {"4-28", new List<FotoFestival>(new[] { R })},
            {"4-29", new List<FotoFestival>(new[] { T })},
            {"4-30", new List<FotoFestival>(new[] { HH, M, T })},
            {"5-1", new List<FotoFestival>(new[] { new FotoFestival("南极长生大帝诞", DJ), S })},
            {"5-3", new List<FotoFestival>(new[] { D })},
            {"5-5", new List<FotoFestival>(new[] { new FotoFestival("地腊", XL), new FotoFestival("五帝校定生人官爵", XL), J, Y })},
            {"5-6", new List<FotoFestival>(new[] { J, L })},
            {"5-7", new List<FotoFestival>(new[] { J })},
            {"5-8", new List<FotoFestival>(new[] { new FotoFestival("南方五道诞"), T })},
            {"5-11", new List<FotoFestival>(new[] { new FotoFestival("天地仓开日", SS), new FotoFestival("天下都城隍诞") })},
            {"5-12", new List<FotoFestival>(new[] { new FotoFestival("炳灵公诞") })},
            {"5-13", new List<FotoFestival>(new[] { new FotoFestival("关圣降", XL) })},
            {"5-14", new List<FotoFestival>(new[] { new FotoFestival("夜子时为天地交泰", JW), T })},
            {"5-15", new List<FotoFestival>(new[] { W, J, T })},
            {"5-16", new List<FotoFestival>(new[] { new FotoFestival("九毒日", JW), new FotoFestival("天地元气造化万物之辰", JW) })},
            {"5-17", new List<FotoFestival>(new[] { J })},
            {"5-18", new List<FotoFestival>(new[] { new FotoFestival("张天师诞") })},
            {"5-22", new List<FotoFestival>(new[] { new FotoFestival("孝娥神诞", DJ) })},
            {"5-23", new List<FotoFestival>(new[] { T })},
            {"5-25", new List<FotoFestival>(new[] { J, H })},
            {"5-26", new List<FotoFestival>(new[] { J })},
            {"5-27", new List<FotoFestival>(new[] { J, D })},
            {"5-28", new List<FotoFestival>(new[] { R })},
            {"5-29", new List<FotoFestival>(new[] { T })},
            {"5-30", new List<FotoFestival>(new[] { HH, M, T })},
            {"6-1", new List<FotoFestival>(new[] { S })},
            {"6-3", new List<FotoFestival>(new[] { new FotoFestival("韦驮菩萨圣诞"), D, Y })},
            {"6-5", new List<FotoFestival>(new[] { new FotoFestival("南赡部洲转大轮", SS) })},
            {"6-6", new List<FotoFestival>(new[] { new FotoFestival("天地仓开日", SS), L })},
            {"6-8", new List<FotoFestival>(new[] { T })},
            {"6-10", new List<FotoFestival>(new[] { new FotoFestival("金粟如来诞") })},
            {"6-14", new List<FotoFestival>(new[] { T })},
            {"6-15", new List<FotoFestival>(new[] { W, T })},
            {"6-19", new List<FotoFestival>(new[] { new FotoFestival("观世音菩萨成道", DJ) })},
            {"6-23", new List<FotoFestival>(new[] { new FotoFestival("南方火神诞", "犯者遭回禄"), T })},
            {"6-24", new List<FotoFestival>(new[] { new FotoFestival("雷祖诞", XL), new FotoFestival("关帝诞", XL) })},
            {"6-25", new List<FotoFestival>(new[] { H })},
            {"6-27", new List<FotoFestival>(new[] { D })},
            {"6-28", new List<FotoFestival>(new[] { R })},
            {"6-29", new List<FotoFestival>(new[] { T })},
            {"6-30", new List<FotoFestival>(new[] { HH, M, T })},
            {"7-1", new List<FotoFestival>(new[] { S, Y })},
            {"7-3", new List<FotoFestival>(new[] { D })},
            {"7-5", new List<FotoFestival>(new[] { new FotoFestival("中会日", SS, false, "一作初七") })},
            {"7-6", new List<FotoFestival>(new[] { L })},
            {"7-7", new List<FotoFestival>(new[] { new FotoFestival("道德腊", XL), new FotoFestival("五帝校生人善恶", XL), new FotoFestival("魁星诞", XL) })},
            {"7-8", new List<FotoFestival>(new[] { T })},
            {"7-10", new List<FotoFestival>(new[] { new FotoFestival("阴毒日", "", false, "大忌") })},
            {"7-12", new List<FotoFestival>(new[] { new FotoFestival("长真谭真人诞") })},
            {"7-13", new List<FotoFestival>(new[] { new FotoFestival("大势至菩萨诞", JS) })},
            {"7-14", new List<FotoFestival>(new[] { new FotoFestival("三元降", JS), T })},
            {"7-15", new List<FotoFestival>(new[] { W, new FotoFestival("三元降", DJ), new FotoFestival("地官校籍", DJ), T })},
            {"7-16", new List<FotoFestival>(new[] { new FotoFestival("三元降", JS) })},
            {"7-18", new List<FotoFestival>(new[] { new FotoFestival("西王母诞", DJ) })},
            {"7-19", new List<FotoFestival>(new[] { new FotoFestival("太岁诞", DJ) })},
            {"7-22", new List<FotoFestival>(new[] { new FotoFestival("增福财神诞", XL) })},
            {"7-23", new List<FotoFestival>(new[] { T })},
            {"7-25", new List<FotoFestival>(new[] { H })},
            {"7-27", new List<FotoFestival>(new[] { D })},
            {"7-28", new List<FotoFestival>(new[] { R })},
            {"7-29", new List<FotoFestival>(new[] { Y, T })},
            {"7-30", new List<FotoFestival>(new[] { new FotoFestival("地藏菩萨诞", DJ), HH, M, T })},
            {"8-1", new List<FotoFestival>(new[] { S, new FotoFestival("许真君诞") })},
            {"8-3", new List<FotoFestival>(new[] { D, new FotoFestival("北斗诞", XL), new FotoFestival("司命灶君诞", "犯者遭回禄") })},
            {"8-5", new List<FotoFestival>(new[] { new FotoFestival("雷声大帝诞", DJ) })},
            {"8-6", new List<FotoFestival>(new[] { L })},
            {"8-8", new List<FotoFestival>(new[] { T })},
            {"8-10", new List<FotoFestival>(new[] { new FotoFestival("北斗大帝诞") })},
            {"8-12", new List<FotoFestival>(new[] { new FotoFestival("西方五道诞") })},
            {"8-14", new List<FotoFestival>(new[] { T })},
            {"8-15", new List<FotoFestival>(new[] { W, new FotoFestival("太明朝元", "犯者暴亡", false, "宜焚香守夜"), T })},
            {"8-16", new List<FotoFestival>(new[] { new FotoFestival("天曹掠刷真君降", "犯者贫夭") })},
            {"8-18", new List<FotoFestival>(new[] { new FotoFestival("天人兴福之辰", "", false, "宜斋戒，存想吉事") })},
            {"8-23", new List<FotoFestival>(new[] { new FotoFestival("汉恒候张显王诞"), T })},
            {"8-24", new List<FotoFestival>(new[] { new FotoFestival("灶君夫人诞") })},
            {"8-25", new List<FotoFestival>(new[] { H })},
            {"8-27", new List<FotoFestival>(new[] { D, new FotoFestival("至圣先师孔子诞", XL), Y })},
            {"8-28", new List<FotoFestival>(new[] { R, new FotoFestival("四天会事") })},
            {"8-29", new List<FotoFestival>(new[] { T })},
            {"8-30", new List<FotoFestival>(new[] { new FotoFestival("诸神考校", "犯者夺算"), HH, M, T })},
            {"9-1", new List<FotoFestival>(new[] { S, new FotoFestival("南斗诞", XL), new FotoFestival("北斗九星降世", DJ, false, "此九日俱宜斋戒") })},
            {"9-3", new List<FotoFestival>(new[] { D, new FotoFestival("五瘟神诞") })},
            {"9-6", new List<FotoFestival>(new[] { L })},
            {"9-8", new List<FotoFestival>(new[] { T })},
            {"9-9", new List<FotoFestival>(new[] { new FotoFestival("斗母诞", XL), new FotoFestival("酆都大帝诞"), new FotoFestival("玄天上帝飞升") })},
            {"9-10", new List<FotoFestival>(new[] { new FotoFestival("斗母降", DJ) })},
            {"9-11", new List<FotoFestival>(new[] { new FotoFestival("宜戒") })},
            {"9-13", new List<FotoFestival>(new[] { new FotoFestival("孟婆尊神诞") })},
            {"9-14", new List<FotoFestival>(new[] { T })},
            {"9-15", new List<FotoFestival>(new[] { W, T })},
            {"9-17", new List<FotoFestival>(new[] { new FotoFestival("金龙四大王诞", "犯者遭水厄") })},
            {"9-19", new List<FotoFestival>(new[] { new FotoFestival("日宫月宫会合", JS), new FotoFestival("观世音菩萨诞", JS) })},
            {"9-23", new List<FotoFestival>(new[] { T })},
            {"9-25", new List<FotoFestival>(new[] { H, Y })},
            {"9-27", new List<FotoFestival>(new[] { D })},
            {"9-28", new List<FotoFestival>(new[] { R })},
            {"9-29", new List<FotoFestival>(new[] { T })},
            {"9-30", new List<FotoFestival>(new[] { new FotoFestival("药师琉璃光佛诞", "犯者危疾"), HH, M, T })},
            {"10-1", new List<FotoFestival>(new[] { S, new FotoFestival("民岁腊", DJ), new FotoFestival("四天王降", "犯者一年内死") })},
            {"10-3", new List<FotoFestival>(new[] { D, new FotoFestival("三茅诞") })},
            {"10-5", new List<FotoFestival>(new[] { new FotoFestival("下会日", JS), new FotoFestival("达摩祖师诞", JS) })},
            {"10-6", new List<FotoFestival>(new[] { L, new FotoFestival("天曹考察", DJ) })},
            {"10-8", new List<FotoFestival>(new[] { new FotoFestival("佛涅槃日", "", false, "大忌色欲"), T })},
            {"10-10", new List<FotoFestival>(new[] { new FotoFestival("四天王降", "犯者一年内死") })},
            {"10-11", new List<FotoFestival>(new[] { new FotoFestival("宜戒") })},
            {"10-14", new List<FotoFestival>(new[] { new FotoFestival("三元降", JS), T })},
            {"10-15", new List<FotoFestival>(new[] { W, new FotoFestival("三元降", DJ), new FotoFestival("下元水府校籍", DJ), T })},
            {"10-16", new List<FotoFestival>(new[] { new FotoFestival("三元降", JS), T })},
            {"10-23", new List<FotoFestival>(new[] { Y, T })},
            {"10-25", new List<FotoFestival>(new[] { H })},
            {"10-27", new List<FotoFestival>(new[] { D, new FotoFestival("北极紫徽大帝降") })},
            {"10-28", new List<FotoFestival>(new[] { R })},
            {"10-29", new List<FotoFestival>(new[] { T })},
            {"10-30", new List<FotoFestival>(new[] { HH, M, T })},
            {"11-1", new List<FotoFestival>(new[] { S })},
            {"11-3", new List<FotoFestival>(new[] { D })},
            {"11-4", new List<FotoFestival>(new[] { new FotoFestival("至圣先师孔子诞", XL) })},
            {"11-6", new List<FotoFestival>(new[] { new FotoFestival("西岳大帝诞") })},
            {"11-8", new List<FotoFestival>(new[] { T })},
            {"11-11", new List<FotoFestival>(new[] { new FotoFestival("天地仓开日", DJ), new FotoFestival("太乙救苦天尊诞", DJ) })},
            {"11-14", new List<FotoFestival>(new[] { T })},
            {"11-15", new List<FotoFestival>(new[] { new FotoFestival("月望", "上半夜犯男死 下半夜犯女死"), new FotoFestival("四天王巡行", "上半夜犯男死 下半夜犯女死") })},
            {"11-17", new List<FotoFestival>(new[] { new FotoFestival("阿弥陀佛诞") })},
            {"11-19", new List<FotoFestival>(new[] { new FotoFestival("太阳日宫诞", "犯者得奇祸") })},
            {"11-21", new List<FotoFestival>(new[] { Y })},
            {"11-23", new List<FotoFestival>(new[] { new FotoFestival("张仙诞", "犯者绝嗣"), T })},
            {"11-25", new List<FotoFestival>(new[] { new FotoFestival("掠刷大夫降", "犯者遭大凶"), H })},
            {"11-26", new List<FotoFestival>(new[] { new FotoFestival("北方五道诞") })},
            {"11-27", new List<FotoFestival>(new[] { D })},
            {"11-28", new List<FotoFestival>(new[] { R })},
            {"11-29", new List<FotoFestival>(new[] { T })},
            {"11-30", new List<FotoFestival>(new[] { HH, M, T })},
            {"12-1", new List<FotoFestival>(new[] { S })},
            {"12-3", new List<FotoFestival>(new[] { D })},
            {"12-6", new List<FotoFestival>(new[] { new FotoFestival("天地仓开日", JS), L })},
            {"12-7", new List<FotoFestival>(new[] { new FotoFestival("掠刷大夫降", "犯者得恶疾") })},
            {"12-8", new List<FotoFestival>(new[] { new FotoFestival("王侯腊", DJ), new FotoFestival("释迦如来成佛之辰"), T, new FotoFestival("初旬内戊日，亦名王侯腊", DJ) })},
            {"12-12", new List<FotoFestival>(new[] { new FotoFestival("太素三元君朝真") })},
            {"12-14", new List<FotoFestival>(new[] { T })},
            {"12-15", new List<FotoFestival>(new[] { W, T })},
            {"12-16", new List<FotoFestival>(new[] { new FotoFestival("南岳大帝诞") })},
            {"12-19", new List<FotoFestival>(new[] { Y })},
            {"12-20", new List<FotoFestival>(new[] { new FotoFestival("天地交道", "犯者促寿") })},
            {"12-21", new List<FotoFestival>(new[] { new FotoFestival("天猷上帝诞") })},
            {"12-23", new List<FotoFestival>(new[] { new FotoFestival("五岳诞降"), T })},
            {"12-24", new List<FotoFestival>(new[] { new FotoFestival("司今朝天奏人善恶", "犯者得大祸") })},
            {"12-25", new List<FotoFestival>(new[] { new FotoFestival("三清玉帝同降，考察善恶", "犯者得奇祸"), H })},
            {"12-27", new List<FotoFestival>(new[] { D })},
            {"12-28", new List<FotoFestival>(new[] { R })},
            {"12-29", new List<FotoFestival>(new[] { new FotoFestival("华严菩萨诞"), T })},
            {"12-30", new List<FotoFestival>(new[] { new FotoFestival("诸神下降，察访善恶", "犯者男女俱亡") })}
        };

        /// <summary>
        /// 纪念日
        /// </summary>
        public virtual Dictionary<string, List<string>> FOTO_OTHER_FESTIVAL { get; } = new Dictionary<string, List<string>>
        {
            {"1-1", new List<string>(new[] { "弥勒菩萨圣诞" })},
            {"1-6", new List<string>(new[] { "定光佛圣诞" })},
            {"2-8", new List<string>(new[] { "释迦牟尼佛出家" })},
            {"2-15", new List<string>(new[] { "释迦牟尼佛涅槃" })},
            {"2-19", new List<string>(new[] { "观世音菩萨圣诞" })},
            {"2-21", new List<string>(new[] { "普贤菩萨圣诞" })},
            {"3-16", new List<string>(new[] { "准提菩萨圣诞" })},
            {"4-4", new List<string>(new[] { "文殊菩萨圣诞" })},
            {"4-8", new List<string>(new[] { "释迦牟尼佛圣诞" })},
            {"4-15", new List<string>(new[] { "佛吉祥日" })},
            {"4-28", new List<string>(new[] { "药王菩萨圣诞" })},
            {"5-13", new List<string>(new[] { "伽蓝菩萨圣诞" })},
            {"6-3", new List<string>(new[] { "韦驮菩萨圣诞" })},
            {"6-19", new List<string>(new[] { "观音菩萨成道" })},
            {"7-13", new List<string>(new[] { "大势至菩萨圣诞" })},
            {"7-15", new List<string>(new[] { "佛欢喜日" })},
            {"7-24", new List<string>(new[] { "龙树菩萨圣诞" })},
            {"7-30", new List<string>(new[] { "地藏菩萨圣诞" })},
            {"8-15", new List<string>(new[] { "月光菩萨圣诞" })},
            {"8-22", new List<string>(new[] { "燃灯佛圣诞" })},
            {"9-9", new List<string>(new[] { "摩利支天菩萨圣诞" })},
            {"9-19", new List<string>(new[] { "观世音菩萨出家" })},
            {"9-30", new List<string>(new[] { "药师琉璃光佛圣诞" })},
            {"10-5", new List<string>(new[] { "达摩祖师圣诞" })},
            {"10-20", new List<string>(new[] { "文殊菩萨出家" })},
            {"11-17", new List<string>(new[] { "阿弥陀佛圣诞" })},
            {"11-19", new List<string>(new[] { "日光菩萨圣诞" })},
            {"12-8", new List<string>(new[] { "释迦牟尼佛成道" })},
            {"12-23", new List<string>(new[] { "监斋菩萨圣诞" })},
            {"12-29", new List<string>(new[] { "华严菩萨圣诞" })}
        };

        /// <summary>
        /// 27星宿，佛教从印度传入中国，印度把28星宿改为27星宿，把牛宿(牛金牛)纳入了女宿(女土蝠)。
        /// </summary>
        public virtual string[] XIU_27 { get; } = { "角", "亢", "氐", "房", "心", "尾", "箕", "斗", "女", "虚", "危", "室", "壁", "奎", "娄", "胃", "昴", "毕", "觜", "参", "井", "鬼", "柳", "星", "张", "翼", "轸" };

        /// <summary>
        /// Lunar.FullString 主段格式，{0}=日期，{1}=年干支，{2}=年生肖，{3}=月干支，{4}=月生肖，{5}=日干支，{6}=日生肖，{7}=时支，{8}=时生肖，{9}=年纳音，{10}=月纳音，{11}=日纳音，{12}=时纳音，{13}=星期
        /// </summary>
        public virtual string FullStringTemplate1 { get; } = "{0} {1}({2})年 {3}({4})月 {5}({6})日 {7}({8})时 纳音[{9} {10} {11} {12}] 星期{13}";

        /// <summary>
        /// Lunar.FullString 尾段格式，{0}=宫，{1}=兽，{2}=宿，{3}=政，{4}=动物，{5}=宿吉凶，{6}=彭祖干，{7}=彭祖支，{8}=喜神，{9}=喜神描述，{10}=阳贵，{11}=阳贵描述，{12}=阴贵，{13}=阴贵描述，{14}=福神，{15}=福神描述，{16}=财神，{17}=财神描述，{18}=冲，{19}=煞
        /// </summary>
        public virtual string FullStringTemplate2 { get; } = " {0}方{1} 星宿[{2}{3}{4}]({5}) 彭祖百忌[{6} {7}] 喜神方位[{8}]({9}) 阳贵神方位[{10}]({11}) 阴贵神方位[{12}]({13}) 福神方位[{14}]({15}) 财神方位[{16}]({17}) 冲[{18}] 煞[{19}]";
        /// <summary>
        /// "闰年"
        /// </summary>
        public virtual string LeapYear { get; } = "闰年";
        /// <summary>
        /// 闰
        /// </summary>
        public virtual string LeapChar { get; } = "闰";
    }
}
